app/controllers/locations_controller.rb

  def create
    @shops = []
    @location = Location.create(location_params)
---
INSERT INTO "locations" ("address", "created_at", "updated_at") VALUES (?, ?, ?)  [["address", "Philadelphia PA"], ["created_at", "2014-10-22 03:31:08.053788"], ["updated_at", "2014-10-22 03:31:08.053788"]]